SaitovSP/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <owners>Catalog.Рестораны</owners>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.Разряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/CommonModules/ПолучениеДанныхТекущегоСеансаСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для Получения ссылок на сотрудника и ресторан текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на сотрудника текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на ресторан текущего пользователя;//  
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции

// Возврат ссылки пользователя и ресторана.
// 
// Параметры:
//  Имя Имя
// 
// Возвращаемое значение:
//  Структура - Возврат ссылки пользователя и ресторана:
// * Ресторан 
// * Сотрудник 
Функция ВозвратСсылкиПользователяИРесторана(Имя) Экспорт
	
		ТекПотльзовательСтруктура = Новый Структура;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Ресторан.Ссылка КАК РесторанСсылка,
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИмяПользователя = &ИмяПользователя";
		Запрос.УстановитьПараметр("ИмяПользователя",Имя);

		РезультатЗапроса = Запрос.Выполнить(); 
		РезультатЗапроса = РезультатЗапроса.Выбрать();
		РезультатЗапроса.Следующий();
		ТекПотльзовательСтруктура.Вставить("Ресторан", РезультатЗапроса.РесторанСсылка);
		ТекПотльзовательСтруктура.Вставить("Сотрудник", РезультатЗапроса.Ссылка);
		Возврат ТекПотльзовательСтруктура; 
		
КонецФункции

// Вернуть значение параметра сеанса текущий пользователь.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Вернуть значение параметра сеанса текущий пользователь
Функция ВернутьЗначениеПараметраСеансаТекущийПользователь () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

// Вернуть значение параметра сеанса текущий ресторан.
// 
// Возвращаемое значение:
//  СправочникСсылка.Рестораны - Вернуть значение параметра сеанса текущий ресторан
Функция ВернутьЗначениеПараметраСеансаТекущийРесторан () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийРесторан;
	
КонецФункции

#КонецОбласти
